In [5]:
import pandas as pd
df=pd.DataFrame()

In [6]:
df['name']=['RAM','Shyam','JAM']
df['age']=[10,15,20]
df['add']=['FGJ','FGF','TTT']

In [7]:
df

    name  age  add
0    RAM   10  FGJ
1  Shyam   15  FGF
2    JAM   20  TTT

In [12]:
copy_df=df.copy(['age'])

In [14]:
copy_df.age

0    10
1    15
2    20
Name: age, dtype: int64

In [15]:
df.head()

    name  age  add
0    RAM   10  FGJ
1  Shyam   15  FGF
2    JAM   20  TTT

In [17]:
df.memory

AttributeError: 'DataFrame' object has no attribute 'memory'

In [18]:
'mango'=='banana'

False

In [19]:
'mango'=='mango'

True

In [22]:
def multipliers ():

    return [lambda x: i * x for i in range (4)]
print [m (2) for m in multipliers ()]

SyntaxError: invalid syntax (<ipython-input-22-1c04ace989ca>, line 4)

In [23]:
x[x [: n-2].argsort ()]

NameError: name 'x' is not defined

In [31]:
def foo (i= 0):

    i.append (1)

    return i
foo()

AttributeError: 'int' object has no attribute 'append'

In [34]:
word = 'aeioubcdfg'

print (word [:3] + word [3:])

aeioubcdfg

In [35]:
df.empty

False

In [39]:
list=['a','e','i','o','u']

list[8:]

[]

In [40]:
import pandas as pd

In [41]:
ufo=pd.read_csv('http://bit.ly/uforeports')

In [42]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [46]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
5                 Valley City
6                 Crater Lake
7                        Alma
8                     Eklutna
9                     Hubbard
10                    Fontana
11                   Waterloo
12                     Belton
13                     Keokuk
14                  Ludington
15                Forest Home
16                Los Angeles
17                  Hapeville
18                     Oneida
19                 Bering Sea
20                   Nebraska
21                        NaN
22                        NaN
23                  Owensboro
24                 Wilderness
25                  San Diego
26                 Wilderness
27                     Clovis
28                 Los Alamos
29               Ft. Duschene
                 ...
18211                 Holyoke
18212                  Carson
18213                Pasadena
18214                  Austin
18215                El Campo
18216            Garden Grove
18217           Berthoud Pass
18218              Sisterdale
18219            Garden Grove
18220             Shasta Lake
18221                Franklin
18222          Albrightsville
18223              Greenville
18224                 Eufaula
18225             Simi Valley
18226           San Francisco
18227           San Francisco
18228              Kingsville
18229                 Chicago
18230             Pismo Beach
18231             Pismo Beach
18232                    Lodi
18233               Anchorage
18234                Capitola
18235          Fountain Hills
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [48]:
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
5                 Valley City
6                 Crater Lake
7                        Alma
8                     Eklutna
9                     Hubbard
10                    Fontana
11                   Waterloo
12                     Belton
13                     Keokuk
14                  Ludington
15                Forest Home
16                Los Angeles
17                  Hapeville
18                     Oneida
19                 Bering Sea
20                   Nebraska
21                        NaN
22                        NaN
23                  Owensboro
24                 Wilderness
25                  San Diego
26                 Wilderness
27                     Clovis
28                 Los Alamos
29               Ft. Duschene
                 ...
18211                 Holyoke
18212                  Carson
18213                Pasadena
18214                  Austin
18215                El Campo
18216            Garden Grove
18217           Berthoud Pass
18218              Sisterdale
18219            Garden Grove
18220             Shasta Lake
18221                Franklin
18222          Albrightsville
18223              Greenville
18224                 Eufaula
18225             Simi Valley
18226           San Francisco
18227           San Francisco
18228              Kingsville
18229                 Chicago
18230             Pismo Beach
18231             Pismo Beach
18232                    Lodi
18233               Anchorage
18234                Capitola
18235          Fountain Hills
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [50]:
ufo['Colors Reported']

0           NaN
1           NaN
2           NaN
3           NaN
4           NaN
5           NaN
6           NaN
7           NaN
8           NaN
9           NaN
10          NaN
11          NaN
12          RED
13          NaN
14          NaN
15          NaN
16          NaN
17          NaN
18          NaN
19          RED
20          NaN
21          NaN
22          NaN
23          NaN
24          NaN
25          NaN
26          NaN
27          NaN
28          NaN
29          NaN
          ...
18211       NaN
18212       NaN
18213     GREEN
18214       NaN
18215       NaN
18216    ORANGE
18217       NaN
18218       NaN
18219       NaN
18220      BLUE
18221       NaN
18222       NaN
18223       NaN
18224       NaN
18225       NaN
18226       NaN
18227       NaN
18228       NaN
18229       NaN
18230       NaN
18231       NaN
18232       NaN
18233       RED
18234       NaN
18235       NaN
18236       NaN
18237       NaN
18238       NaN
18239       RED
18240       NaN
Name: Colors Reported, Length: 18241, dtype: object

In [51]:
ufo.shape

(18241, 5)

In [54]:
type(ufo)

pandas.core.frame.DataFrame

In [55]:
type(ufo.City)

pandas.core.series.Series

In [57]:
ufo.describe()

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [58]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [59]:
ufo.index

RangeIndex(start=0, stop=18241, step=1)

In [61]:
ufo.rename(columns={'Colors Reported':'Colore_reported','Shape Reported':'Shape_Reported'}, inplace=True)

In [63]:
ufo.columns

Index(['City', 'Colore_reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

In [64]:
ufo_cols=['city','color_re','shape_report','state','time']

In [65]:
ufo.columns=ufo_cols

In [67]:
ufo.columns

Index(['city', 'color_re', 'shape_report', 'state', 'time'], dtype='object')

In [68]:
ufo.head()

                   city color_re shape_report state             time
0                Ithaca      NaN     TRIANGLE    NY   6/1/1930 22:00
1           Willingboro      NaN        OTHER    NJ  6/30/1930 20:00
2               Holyoke      NaN         OVAL    CO  2/15/1931 14:00
3               Abilene      NaN         DISK    KS   6/1/1931 13:00
4  New York Worlds Fair      NaN        LIGHT    NY  4/18/1933 19:00

In [69]:
ufo.drop('color_re', axis=1, inplace=True)

In [70]:
ufo.columns

Index(['city', 'shape_report', 'state', 'time'], dtype='object')

In [76]:
ufo.drop(['city','state'], axis=1, inplace=True)

In [77]:
ufo.columns

Index(['shape_report', 'time'], dtype='object')

In [78]:
df1=pd.read_csv('http://bit.ly/2uQbFHS')

In [79]:
df1.head()

        Date    Open    High     Low   Close    Volume
0   7-Jul-17  142.90  144.75  142.90  144.18  19201712
1   6-Jul-17  143.02  143.50  142.41  142.73  24128782
2   5-Jul-17  143.69  144.79  142.72  144.09  21569557
3   3-Jul-17  144.88  145.30  143.10  143.50  14277848
4  30-Jun-17  144.45  144.96  143.78  144.02  23024107

In [84]:
df1['Date'].sort_values(ascending=False).head()

207    9-Sep-16
164    9-Nov-16
41     9-May-17
83     9-Mar-17
19     9-Jun-17
Name: Date, dtype: object

In [87]:
df1['Open'].sort_values(ascending=False).tail()

248    97.41
247    97.39
249    97.17
239    96.82
250    96.75
Name: Open, dtype: float64

In [90]:
booleans=[]
for length in df1.High:
    if length>142:
        booleans.append(True)
    else:
        booleans.append(False)

In [91]:
booleans[0:5]

[True, True, True, True, True]